# Задайте список из нескольких чисел. Напишите программу,
# которая найдёт сумму элементов списка, стоящих на нечётной позиции.
#
# Пример:
# - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12


# num_list = list(map(int, input().split()))
# num_list2 = []
# i = 0
# while i < len(num_list):
#     if i % 2 == 1:
#         num_list2.append(num_list[i])
#     i += 1
# print(num_list)
# print(num_list2)
# print(sum(num_list2))


